In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
np.random.randn(6, 4)

array([[ 0.04573272,  0.48590337,  0.42587444, -1.18880631],
       [-0.42380995,  0.81388722, -0.81062966, -0.66487753],
       [-0.86349762, -0.33112477, -1.7900062 , -0.90391604],
       [-0.38954176, -0.26721942, -0.85621819, -0.21515868],
       [-1.19880054,  0.35989471, -0.09811179,  1.18886854],
       [ 0.91869033, -0.81533665, -0.31483487, -2.24291875]])

In [9]:
# np.random.randn(6, 4) 创建6行4列的随机数

In [25]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [24]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -0.241426 -0.398565 -0.083551  1.712889
2013-01-02 -1.017358 -1.040088 -0.088888 -0.048374
2013-01-03  0.415983  0.326709  0.661979 -0.110170
2013-01-04 -1.196444 -0.228005 -0.346718 -1.630210
2013-01-05 -0.871006  1.634062 -0.678802 -1.379525
2013-01-06  0.108089 -0.405339 -1.369055  0.178841

In [36]:
df.sort_values(by="A",axis=0,ascending=False)

                   A         B         C         D
2013-01-01  1.712889 -0.083551 -0.398565 -0.241426
2013-01-06  0.178841 -1.369055 -0.405339  0.108089
2013-01-02 -0.048374 -0.088888 -1.040088 -1.017358
2013-01-03 -0.110170  0.661979  0.326709  0.415983
2013-01-05 -1.379525 -0.678802  1.634062 -0.871006
2013-01-04 -1.630210 -0.346718 -0.228005 -1.196444

In [37]:
df['A']

2013-01-01    1.712889
2013-01-02   -0.048374
2013-01-03   -0.110170
2013-01-04   -1.630210
2013-01-05   -1.379525
2013-01-06    0.178841
Freq: D, Name: A, dtype: float64

In [39]:
df[0:3]

                   A         B         C         D
2013-01-01  1.712889 -0.083551 -0.398565 -0.241426
2013-01-02 -0.048374 -0.088888 -1.040088 -1.017358
2013-01-03 -0.110170  0.661979  0.326709  0.415983

In [44]:
df.loc[:,'A':'C']

                   A         B         C
2013-01-01  1.712889 -0.083551 -0.398565
2013-01-02 -0.048374 -0.088888 -1.040088
2013-01-03 -0.110170  0.661979  0.326709
2013-01-04 -1.630210 -0.346718 -0.228005
2013-01-05 -1.379525 -0.678802  1.634062
2013-01-06  0.178841 -1.369055 -0.405339

In [45]:
df.loc['20130102', ['A', 'B']]

A   -0.048374
B   -0.088888
Name: 2013-01-02 00:00:00, dtype: float64

In [68]:
df.iloc[0:2]

                   A         B         C         D
2013-01-01  1.712889 -0.083551 -0.398565 -0.241426
2013-01-02 -0.048374 -0.088888 -1.040088 -1.017358

In [73]:
(df>0).sum().sum()

7

In [74]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [75]:
dates[0:4]

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04'], dtype='datetime64[ns]', freq='D')

In [76]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [77]:
df1

                   A         B         C         D   E
2013-01-01  1.712889 -0.083551 -0.398565 -0.241426 NaN
2013-01-02 -0.048374 -0.088888 -1.040088 -1.017358 NaN
2013-01-03 -0.110170  0.661979  0.326709  0.415983 NaN
2013-01-04 -1.630210 -0.346718 -0.228005 -1.196444 NaN

In [78]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [79]:
df1

                   A         B         C         D    E
2013-01-01  1.712889 -0.083551 -0.398565 -0.241426  1.0
2013-01-02 -0.048374 -0.088888 -1.040088 -1.017358  1.0
2013-01-03 -0.110170  0.661979  0.326709  0.415983  NaN
2013-01-04 -1.630210 -0.346718 -0.228005 -1.196444  NaN

In [80]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01  1.712889 -0.083551 -0.398565 -0.241426  1.0
2013-01-02 -0.048374 -0.088888 -1.040088 -1.017358  1.0

In [85]:
df1.iloc[0,0]=np.nan

In [87]:
df1

                   A         B         C         D    E
2013-01-01       NaN -0.083551 -0.398565 -0.241426  1.0
2013-01-02 -0.048374 -0.088888 -1.040088 -1.017358  1.0
2013-01-03 -0.110170  0.661979  0.326709  0.415983  NaN
2013-01-04 -1.630210 -0.346718 -0.228005 -1.196444  NaN

In [88]:
df1.fillna(666)

                     A         B         C         D      E
2013-01-01  666.000000 -0.083551 -0.398565 -0.241426    1.0
2013-01-02   -0.048374 -0.088888 -1.040088 -1.017358    1.0
2013-01-03   -0.110170  0.661979  0.326709  0.415983  666.0
2013-01-04   -1.630210 -0.346718 -0.228005 -1.196444  666.0

In [96]:
df1.fillna({"A":100})

                     A         B         C         D    E
2013-01-01  100.000000 -0.083551 -0.398565 -0.241426  1.0
2013-01-02   -0.048374 -0.088888 -1.040088 -1.017358  1.0
2013-01-03   -0.110170  0.661979  0.326709  0.415983  NaN
2013-01-04   -1.630210 -0.346718 -0.228005 -1.196444  NaN

In [102]:
df.apply(lambda d:print(d))

2013-01-01    1.712889
2013-01-02   -0.048374
2013-01-03   -0.110170
2013-01-04   -1.630210
2013-01-05   -1.379525
2013-01-06    0.178841
Freq: D, Name: A, dtype: float64
2013-01-01   -0.083551
2013-01-02   -0.088888
2013-01-03    0.661979
2013-01-04   -0.346718
2013-01-05   -0.678802
2013-01-06   -1.369055
Freq: D, Name: B, dtype: float64
2013-01-01   -0.398565
2013-01-02   -1.040088
2013-01-03    0.326709
2013-01-04   -0.228005
2013-01-05    1.634062
2013-01-06   -0.405339
Freq: D, Name: C, dtype: float64
2013-01-01   -0.241426
2013-01-02   -1.017358
2013-01-03    0.415983
2013-01-04   -1.196444
2013-01-05   -0.871006
2013-01-06    0.108089
Freq: D, Name: D, dtype: float64

A    None
B    None
C    None
D    None
dtype: object

In [103]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [104]:
s

0    4
1    3
2    3
3    6
4    6
5    3
6    1
7    4
8    3
9    5
dtype: int64

In [105]:
np.random.randint(0, 7, size=10)

array([5, 0, 1, 5, 2, 4, 4, 3, 6, 6])

In [106]:
 s.value_counts()

3    4
6    2
4    2
5    1
1    1
dtype: int64

In [108]:
df = pd.DataFrame(np.random.randn(10, 4))

In [109]:
df

          0         1         2         3
0  0.299340 -0.923821  0.022839 -0.414306
1  1.027366  0.207039  0.841443 -1.553674
2 -0.683326  0.350790 -0.378271  0.603082
3 -0.615287  0.747492  0.109209 -0.178165
4 -0.542706 -1.943662  0.237748  0.343428
5  0.411720 -0.479555  1.550252 -1.328954
6  0.924267 -1.317790  0.785314  0.585574
7  1.937068  0.502867 -1.424105  0.014342
8  0.221443 -0.133204  0.754182 -0.215251
9  2.471359  1.780202  0.684189  0.417079

In [111]:
pieces = [df[:3], df[3:7], df[7:]]

In [112]:
pieces

[          0         1         2         3
 0  0.299340 -0.923821  0.022839 -0.414306
 1  1.027366  0.207039  0.841443 -1.553674
 2 -0.683326  0.350790 -0.378271  0.603082,
           0         1         2         3
 3 -0.615287  0.747492  0.109209 -0.178165
 4 -0.542706 -1.943662  0.237748  0.343428
 5  0.411720 -0.479555  1.550252 -1.328954
 6  0.924267 -1.317790  0.785314  0.585574,
           0         1         2         3
 7  1.937068  0.502867 -1.424105  0.014342
 8  0.221443 -0.133204  0.754182 -0.215251
 9  2.471359  1.780202  0.684189  0.417079]

In [113]:
pd.concat(pieces)

          0         1         2         3
0  0.299340 -0.923821  0.022839 -0.414306
1  1.027366  0.207039  0.841443 -1.553674
2 -0.683326  0.350790 -0.378271  0.603082
3 -0.615287  0.747492  0.109209 -0.178165
4 -0.542706 -1.943662  0.237748  0.343428
5  0.411720 -0.479555  1.550252 -1.328954
6  0.924267 -1.317790  0.785314  0.585574
7  1.937068  0.502867 -1.424105  0.014342
8  0.221443 -0.133204  0.754182 -0.215251
9  2.471359  1.780202  0.684189  0.417079

In [114]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [115]:
left

   key  lval
0  foo     1
1  foo     2

In [116]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [117]:
right

   key  rval
0  foo     4
1  foo     5

In [119]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [120]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                     'C': np.random.randn(8),
                    'D': np.random.randn(8)})

In [121]:
df

     A      B         C         D
0  foo    one  0.140179 -0.661968
1  bar    one -0.362352  0.403923
2  foo    two  0.598954 -2.464730
3  bar  three -0.205985 -0.490129
4  foo    two -0.267970 -0.570156
5  bar    two -0.671819  1.383861
6  foo    one  0.727209 -1.250508
7  foo  three -1.274937  0.243279

In [125]:
df.groupby('A').sum()

            C         D
A
bar -1.240157  1.297654
foo -0.076566 -4.704082

In [126]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                       'B': ['A', 'B', 'C'] * 4,
                     'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                     'D': np.random.randn(12),
                     'E': np.random.randn(12)})

In [127]:
df

        A  B    C         D         E
0     one  A  foo -1.744828  0.382089
1     one  B  foo  1.232333  0.075393
2     two  C  foo  0.222852 -0.118930
3   three  A  bar  0.257958 -0.283385
4     one  B  bar -0.561757 -0.838610
5     one  C  bar  0.221397 -0.712347
6     two  A  foo  0.390544 -0.229818
7   three  B  foo  0.878644 -0.052741
8     one  C  foo  0.943317  0.887135
9     one  A  bar  0.677664 -0.296530
10    two  B  bar  0.546293 -1.624501
11  three  C  bar -1.712927 -0.920309

In [131]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

              D         E
A
one    0.128021 -0.083811
three -0.192109 -0.418812
two    0.386563 -0.657750

In [145]:
rating=pd.DataFrame({'userId':np.random.randint(1,100,10),'movieId':np.random.randint(1,100,10),'rate':np.random.randint(1,5,10)})

In [146]:
rating

   userId  movieId  rate
0      54       33     2
1       1       19     4
2      29        1     3
3      93       80     1
4      45       85     3
5      20        3     3
6       2       40     4
7      23        7     2
8      67       88     2
9      97       12     1

In [148]:
rating.pivot(index='userId', columns='movieId', values='rate')

movieId   1    3    7    12   19   33   40   80   85   88
userId
1        NaN  NaN  NaN  NaN  4.0  NaN  NaN  NaN  NaN  NaN
2        NaN  NaN  NaN  NaN  NaN  NaN  4.0  NaN  NaN  NaN
20       NaN  3.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
23       NaN  NaN  2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN
29       3.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
45       NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  3.0  NaN
54       NaN  NaN  NaN  NaN  NaN  2.0  NaN  NaN  NaN  NaN
67       NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  2.0
93       NaN  NaN  NaN  NaN  NaN  NaN  NaN  1.0  NaN  NaN
97       NaN  NaN  NaN  1.0  NaN  NaN  NaN  NaN  NaN  NaN